org/20200618220802-velocity_obstacles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2020-06-19 Fri 00:10 -->
    <meta http-equiv="Content-Type"
    content="text/html;charset=utf-8" />
    <meta name="viewport"
    content="width=device-width, initial-scale=1" />
    <title>Velocity Obstacles</title>
    <meta name="generator" content="Org mode" />
    <meta name="author" content="Alex Day" />
  </head>
  <body>
    <div id="content">
      <h1 class="title">Velocity Obstacles</h1>
      <div id="table-of-contents">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents">
          <ul>
            <li>
              <a href="#orgcdc7149">1. Slides</a>
              <ul>
                <li>
                  <a href="#orgbfdac5b">1.1. From Cartesian to
                  velocity space</a>
                </li>
                <li>
                  <a href="#org7cc9364">1.2. Velocity Space</a>
                </li>
                <li>
                  <a href="#orgad1874c">1.3. Revising
                  definition</a>
                </li>
                <li>
                  <a href="#orga8a8555">1.4. Time horizon VO</a>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgcdc7149" class="outline-2">
        <h2 id="orgcdc7149">
        <span class="section-number-2">1</span>Slides</h2>
        <div class="outline-text-2" id="text-1"></div>
        <div id="outline-container-orgbfdac5b" class="outline-3">
          <h3 id="orgbfdac5b">
          <span class="section-number-3">1.1</span>From Cartesian
          to velocity space</h3>
          <div class="outline-text-3" id="text-1-1">
            <p>If you take a Cartesian space where agent A is
            centered and a point. Then B is at position x
            <sub>b</sub>-x
            <sub>a</sub>and has a radius of r
            <sub>a</sub>+r
            <sub>b</sub>(because A is a point and the radius has to
            be inflated).</p>
            <p>By doing this you calculate the Minkowski sum. The
            Minkowsi sum is X ⊕ Y = {x + y | x ∈ X, y ∈ Y}. So if X
            is the position of A {[0, 0]}, and Y is the position of
            B {[1, 1]}. Then X ⊕ Y = {[1, 1]}.</p>
          </div>
        </div>
        <div id="outline-container-org7cc9364" class="outline-3">
          <h3 id="org7cc9364">
          <span class="section-number-3">1.2</span>Velocity
          Space</h3>
          <div class="outline-text-3" id="text-1-2">
            <p>If we take that same 2d plane but change the X and Y
            axis and change them to velocities (by dividing
            everything by one second).</p>
            <p>Now every point in this space denotes a velocity.
            The question now is what is the set of velocities that
            will lead to a collision. This is the VO
            <sub>A|B</sub></p>
            <p>If we pick some point V
            <sub>1</sub>and have it define a ray starting at the
            origin and going through V
            <sub>1</sub>and that ray passes through the disk at
            some time τ &gt;= 0 then this is a colliding velocity
            and is in VO
            <sub>A|B</sub>.</p>
          </div>
        </div>
        <div id="outline-container-orgad1874c" class="outline-3">
          <h3 id="orgad1874c">
          <span class="section-number-3">1.3</span>Revising
          definition</h3>
          <div class="outline-text-3" id="text-1-3">
            <p>Lets pick some V. If for any τ &gt;= 0 Vτ is in the
            set denoted by the circle with origin at x
            <sub>b</sub>- x
            <sub>a</sub>with radius r
            <sub>a</sub>+ r
            <sub>b</sub>then it is in the VO
            <sub>A|B</sub>.</p>
            <p>This leads to the time to collision equation</p>
          </div>
        </div>
        <div id="outline-container-orga8a8555" class="outline-3">
          <h3 id="orga8a8555">
          <span class="section-number-3">1.4</span>Time horizon
          VO</h3>
          <div class="outline-text-3" id="text-1-4">
          <p>If you move a disk closer to the origin you can find
          the time horizon VO.</p>
          <p>Given two agents, A and B, the velocity obstacle VO
          <sup>τ
          <sub>H</sub></sup>
          <sub>A|B</sub>(read: the velocity obstacle of A induced
          by B for time horizon τ
          <sub>H</sub>) is the set of all relative velocities that
          will lead to a collision between A and B at some moment
          within the next τ
          <sub>H</sub>seconds.</p>\begin{equation}
          VO^{\tau_{H}}_{A|B} = { v | \exists \tau \in [0,
          \tau_{H}]: \tau V \cap \in D(x_{B} - X_{A}, r_{A} +
          r_{B}_{}) \ne \emptyset } \end{equation} 
          <p>The velocity obstacle VO for time horizon τ
          <sub>H</sub>induced on A by B is equal to all velocities
          such that a τ exists between 0 and τ
          <sub>H</sub>(inclusive) such that τ V unioned with the
          disk centered at X
          <sub>B</sub>- X
          <sub>A</sub>with radius r
          <sub>A</sub>+ r
          <sub>B</sub>is not empty.</p>
          <p>If a collision happens beyond a certain τ
          <sub>H</sub>it might not matter</p>
          <p>Geometrically, this VO is still a cone (assuming
          circular agents). But this cone is truncated by a disk of
          radius (r
          <sub>A</sub>+ r
          <sub>B</sub>)/τ
          <sub>H</sub>and centered at (x
          <sub>A</sub>- x
          <sub>B</sub>)/τ
          <sub>H</sub>compared to the VO discussed above.</p>
          <p>GOT TO 24:40 ish</p></div>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="author">Author: Alex Day</p>
      <p class="date">Created: 2020-06-19 Fri 00:10</p>
    </div>
  </body>
</html>
